Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.3.58/edc/PIC32MZ2048EFH144.PIC
      <edc:SFRDef edc:_addr="0x1F860690" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="7" edc:access="----------------nnnn--nnnn----nn" edc:cname="CNSTATG" edc:desc="" edc:grp="PORTG" edc:impl="0xfffff3c3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000--0000----00" edc:name="CNSTATG" edc:nzwidth="0x20" edc:por="----------------0000--0000----00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNSTATG0" edc:desc="" edc:mask="0x1" edc:name="CNSTATG0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG1" edc:desc="" edc:mask="0x1" edc:name="CNSTATG1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG6" edc:desc="" edc:mask="0x1" edc:name="CNSTATG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG7" edc:desc="" edc:mask="0x1" edc:name="CNSTATG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG8" edc:desc="" edc:mask="0x1" edc:name="CNSTATG8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG9" edc:desc="" edc:mask="0x1" edc:name="CNSTATG9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG12" edc:desc="" edc:mask="0x1" edc:name="CNSTATG12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG13" edc:desc="" edc:mask="0x1" edc:name="CNSTATG13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG14" edc:desc="" edc:mask="0x1" edc:name="CNSTATG14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG15" edc:desc="" edc:mask="0x1" edc:name="CNSTATG15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8606A0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="7" edc:access="----------------nnnn--nnnn----nn" edc:cname="CNNEG" edc:desc="" edc:impl="0xf3c3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000--0000----00" edc:name="CNNEG" edc:nzwidth="32" edc:por="----------------0000--0000----00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNNEG0" edc:mask="0x1" edc:name="CNNEG0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEG1" edc:mask="0x1" edc:name="CNNEG1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNNEG6" edc:mask="0x1" edc:name="CNNEG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEG7" edc:mask="0x1" edc:name="CNNEG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEG8" edc:mask="0x1" edc:name="CNNEG8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEG9" edc:mask="0x1" edc:name="CNNEG9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNNEG12" edc:mask="0x1" edc:name="CNNEG12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEG13" edc:mask="0x1" edc:name="CNNEG13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEG14" edc:mask="0x1" edc:name="CNNEG14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEG15" edc:mask="0x1" edc:name="CNNEG15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8606B0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="7" edc:access="----------------nnnn--nnnn----nn" edc:cname="CNFG" edc:desc="" edc:impl="0xf3c3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000--0000----00" edc:name="CNFG" edc:nzwidth="32" edc:por="----------------0000--0000----00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNFG0" edc:mask="0x1" edc:name="CNFG0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFG1" edc:mask="0x1" edc:name="CNFG1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNFG6" edc:mask="0x1" edc:name="CNFG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFG7" edc:mask="0x1" edc:name="CNFG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFG8" edc:mask="0x1" edc:name="CNFG8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFG9" edc:mask="0x1" edc:name="CNFG9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNFG12" edc:mask="0x1" edc:name="CNFG12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFG13" edc:mask="0x1" edc:name="CNFG13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFG14" edc:mask="0x1" edc:name="CNFG14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFG15" edc:mask="0x1" edc:name="CNFG15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8606C0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="7" edc:access="-----------------nnn--n--n------" edc:cname="SRCON0G" edc:desc="" edc:impl="0x7240" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------000--0--0------" edc:name="SRCON0G" edc:nzwidth="32" edc:por="-----------------000--0--0------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR0G6" edc:mask="0x1" edc:name="SR0G6" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR0G9" edc:mask="0x1" edc:name="SR0G9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR0G12" edc:mask="0x1" edc:name="SR0G12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0G13" edc:mask="0x1" edc:name="SR0G13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0G14" edc:mask="0x1" edc:name="SR0G14" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8606D0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="7" edc:access="-----------------nnn--n--n------" edc:cname="SRCON1G" edc:desc="" edc:impl="0x7240" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------000--0--0------" edc:name="SRCON1G" edc:nzwidth="32" edc:por="-----------------000--0--0------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR1G6" edc:mask="0x1" edc:name="SR1G6" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR1G9" edc:mask="0x1" edc:name="SR1G9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR1G12" edc:mask="0x1" edc:name="SR1G12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1G13" edc:mask="0x1" edc:name="SR1G13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1G14" edc:mask="0x1" edc:name="SR1G14" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8606E0" edc:offset="0x20"/>
      <edc:SFRDef edc:_addr="0x1F860700" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="8" edc:access="-------------------------nnn--nn" edc:cname="ANSELH" edc:desc="" edc:grp="PORTH" edc:impl="0xffff0073" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------------111--11" edc:name="ANSELH" edc:nzwidth="0x20" edc:por="-------------------------111--11" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ANSH0" edc:desc="" edc:mask="0x1" edc:name="ANSH0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSH1" edc:desc="" edc:mask="0x1" edc:name="ANSH1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSH4" edc:desc="" edc:mask="0x1" edc:name="ANSH4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSH5" edc:desc="" edc:mask="0x1" edc:name="ANSH5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSH6" edc:desc="" edc:mask="0x1" edc:name="ANSH6" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
