Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.3.58/edc/PIC32MZ2048EFH144.PIC
      <edc:SFRDef edc:_addr="0x1F860970" edc:_begin="0x10" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="10" edc:access="----------------n---n-----------" edc:cname="CNCONK" edc:desc="" edc:grp="PORTK" edc:impl="0xffff9fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0---0-----------" edc:name="CNCONK" edc:nzwidth="0x20" edc:por="----------------0---0-----------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0xb"/>
            <edc:SFRFieldDef edc:cname="EDGEDETECT" edc:mask="0x1" edc:name="EDGEDETECT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE K" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860980" edc:_begin="0x10" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="10" edc:access="------------------------nnnnnnnn" edc:cname="CNENK" edc:desc="" edc:grp="PORTK" edc:impl="0xffc000ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="CNENK" edc:nzwidth="0x20" edc:por="------------------------00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIEK0" edc:desc="" edc:mask="0x1" edc:name="CNIEK0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEK1" edc:desc="" edc:mask="0x1" edc:name="CNIEK1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEK2" edc:desc="" edc:mask="0x1" edc:name="CNIEK2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEK3" edc:desc="" edc:mask="0x1" edc:name="CNIEK3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEK4" edc:desc="" edc:mask="0x1" edc:name="CNIEK4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEK5" edc:desc="" edc:mask="0x1" edc:name="CNIEK5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEK6" edc:desc="" edc:mask="0x1" edc:name="CNIEK6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEK7" edc:desc="" edc:mask="0x1" edc:name="CNIEK7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860990" edc:_begin="0x10" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="10" edc:access="------------------------nnnnnnnn" edc:cname="CNSTATK" edc:desc="" edc:grp="PORTK" edc:impl="0xffff00ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="CNSTATK" edc:nzwidth="0x20" edc:por="------------------------00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNSTATK0" edc:desc="" edc:mask="0x1" edc:name="CNSTATK0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATK1" edc:desc="" edc:mask="0x1" edc:name="CNSTATK1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATK2" edc:desc="" edc:mask="0x1" edc:name="CNSTATK2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATK3" edc:desc="" edc:mask="0x1" edc:name="CNSTATK3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATK4" edc:desc="" edc:mask="0x1" edc:name="CNSTATK4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATK5" edc:desc="" edc:mask="0x1" edc:name="CNSTATK5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATK6" edc:desc="" edc:mask="0x1" edc:name="CNSTATK6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATK7" edc:desc="" edc:mask="0x1" edc:name="CNSTATK7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8609A0" edc:_begin="0x10" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="10" edc:access="------------------------nnnnnnnn" edc:cname="CNNEK" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="CNNEK" edc:nzwidth="32" edc:por="------------------------00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNNEK0" edc:mask="0x1" edc:name="CNNEK0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK1" edc:mask="0x1" edc:name="CNNEK1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK2" edc:mask="0x1" edc:name="CNNEK2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK3" edc:mask="0x1" edc:name="CNNEK3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK4" edc:mask="0x1" edc:name="CNNEK4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK5" edc:mask="0x1" edc:name="CNNEK5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK6" edc:mask="0x1" edc:name="CNNEK6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK7" edc:mask="0x1" edc:name="CNNEK7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
